In [1]:
import pandas as pd

In [2]:
sp = pd.read_csv('supershops.csv')

In [3]:
sp.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

# Normalization

In [4]:
# marketing sepend
#https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.MinMaxScaler.html

In [5]:
from sklearn.preprocessing import MinMaxScaler
m = MinMaxScaler()

In [6]:
sk_mar = m.fit(sp[['Marketing Spend']])#fit means traing

In [7]:
sk_mar

MinMaxScaler()

In [8]:
sp.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [9]:
sp[['Marketing Spend']]=m.transform(sp[['Marketing Spend']])

In [10]:
sp.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

In [11]:
#fit and transfrom
sp[['Administration']]=m.fit_transform(sp[['Administration']])

In [12]:
sp.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744  471784.10    Dhaka  192261.83
1         0.983359        0.761972  443898.53      Ctg  191792.06
2         0.927985        0.379579  407934.54  Rangpur  191050.39
3         0.873136        0.512998  383199.62    Dhaka  182901.99
4         0.859438        0.305328  366168.42  Rangpur  166187.94

In [13]:
sp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Marketing Spend  50 non-null     float64
 1   Administration   50 non-null     float64
 2   Transport        49 non-null     float64
 3   Area             50 non-null     object
 4   Profit           50 non-null     float64
dtypes: float64(4), object(1)
memory usage: 2.1+ KB

# minMaxusing forloop

In [14]:
x = sp.drop('Profit',axis=1)
y = sp[['Profit']]

 x.head()

In [15]:
x1 = x.copy()
x2= x.copy()
x3 = x.copy()
x4 = x.copy()
x5 = x.copy()
x6 = x.copy()

# strandard Scaler

In [16]:
from sklearn.preprocessing import StandardScaler
S = StandardScaler()

In [17]:
sp.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744  471784.10    Dhaka  192261.83
1         0.983359        0.761972  443898.53      Ctg  191792.06
2         0.927985        0.379579  407934.54  Rangpur  191050.39
3         0.873136        0.512998  383199.62    Dhaka  182901.99
4         0.859438        0.305328  366168.42  Rangpur  166187.94

In [18]:
sak_sta = S.fit(sp[['Marketing Spend']]) #tranig

In [19]:
sp.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744  471784.10    Dhaka  192261.83
1         0.983359        0.761972  443898.53      Ctg  191792.06
2         0.927985        0.379579  407934.54  Rangpur  191050.39
3         0.873136        0.512998  383199.62    Dhaka  182901.99
4         0.859438        0.305328  366168.42  Rangpur  166187.94

In [20]:
sp[['Marketing Spend']] = S.transform(sp[['Marketing Spend']])#trasfrom

In [21]:
sp.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.651744  471784.10    Dhaka  192261.83
1         1.955860        0.761972  443898.53      Ctg  191792.06
2         1.754364        0.379579  407934.54  Rangpur  191050.39
3         1.554784        0.512998  383199.62    Dhaka  182901.99
4         1.504937        0.305328  366168.42  Rangpur  166187.94

In [22]:
#fint and transform

sp[['Administration']] = S.fit_transform(sp[['Administration']])

In [23]:
sp.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753  471784.10    Dhaka  192261.83
1         1.955860        1.082807  443898.53      Ctg  191792.06
2         1.754364       -0.728257  407934.54  Rangpur  191050.39
3         1.554784       -0.096365  383199.62    Dhaka  182901.99
4         1.504937       -1.079919  366168.42  Rangpur  166187.94

# Robust Scaler

In [24]:
from sklearn.preprocessing import RobustScaler
R = RobustScaler()

In [25]:
sp.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753  471784.10    Dhaka  192261.83
1         1.955860        1.082807  443898.53      Ctg  191792.06
2         1.754364       -0.728257  407934.54  Rangpur  191050.39
3         1.554784       -0.096365  383199.62    Dhaka  182901.99
4         1.504937       -1.079919  366168.42  Rangpur  166187.94

In [31]:
#fint and transform

sp[['Administration']] = S.fit_transform(sp[['Administration']])

In [32]:
sp.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753  471784.10    Dhaka  192261.83
1         1.955860        1.082807  443898.53      Ctg  191792.06
2         1.754364       -0.728257  407934.54  Rangpur  191050.39
3         1.554784       -0.096365  383199.62    Dhaka  182901.99
4         1.504937       -1.079919  366168.42  Rangpur  166187.94

In [33]:
from sklearn.preprocessing import MaxAbsScaler
Mb = MaxAbsScaler()

In [34]:
sp.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753  471784.10    Dhaka  192261.83
1         1.955860        1.082807  443898.53      Ctg  191792.06
2         1.754364       -0.728257  407934.54  Rangpur  191050.39
3         1.554784       -0.096365  383199.62    Dhaka  182901.99
4         1.504937       -1.079919  366168.42  Rangpur  166187.94

In [35]:
#fint and transform

sp[['Administration']] = Mb.fit_transform(sp[['Administration']])

In [36]:
sp.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.221993  471784.10    Dhaka  192261.83
1         1.955860        0.428666  443898.53      Ctg  191792.06
2         1.754364       -0.288305  407934.54  Rangpur  191050.39
3         1.554784       -0.038149  383199.62    Dhaka  182901.99
4         1.504937       -0.427523  366168.42  Rangpur  166187.94